Repository: open-eid/RIA-DigiDoc-iOS
Catalog: RIADigiDoc/Supporting files/Localizable.xcstrings
Source language: en
Languages: et

source: No recent documents
et: Ümbrikud puuduvad

source: No recipients found
et: Adressaati ei leitud

# Not a mobile-id client
source: User is not a mobile-ID client
et: Kasutaja ei ole mobiil-ID klient

source: OCSP Certificate
et: Kehtivuskinnituse sertifikaat

source: OCSP Certificate issuer
et: Kehtivuskinnituse sertifikaadi väljaandja

# OCSP response not in valid time slot
source: Please check your smart device time
et: Palun kontrolli oma nutiseadme kellaaega

# OCSP response not in valid time slot url
source: https://www.id.ee/en/article/ria-digidoc-error-please-check-your-smart-device-time/
et: https://www.id.ee/artikkel/ria-digidoc-viga-palun-kontrollige-oma-nutiseadme-kellaaega/

source: OCSP time
et: Kehtivuskinnituse aeg

source: OCSP time (UTC)
et: Kehtivuskinnituse aeg (UTC)

# Open Button
source: Open
et: Ava

source: Open file
et: Ava fail

source: Personal code
et: Isikukood

source: Personal code is not valid.
et: Isikukood pole korrektne.

source: Phone is not in coverage area
et: Telefon ei ole levis

# PIN blocked
source: %1$@ is blocked, because %1$@ has been inserted 3 times incorrectly.
et: %1$@ on blokeeritud, kuna %1$@-koodi on sisestatud 3 korda valesti.

source: PIN change failed
et: PINi vahetamine ebaõnnestus

# PIN changed
source: %@ changed
et: %@ muudetud

# PIN code
source: %@ code
et: %@-kood

# PIN guideline title
source: %@ change guidelines
et: %@ muutmise juhend

# PIN length requirement
source: %1$@ code must be at least %2$@ and a maximum of %3$@ digits long.
et: %1$@-kood peab olema vähemalt %2$@-kohaline ja maksimaalselt %3$@-kohaline.

# PIN part of date of birth
source: New %1$@ code can't be your date of birth
et: Uus %1$@-kood ei saa olla sinu sünnikuupäev

# PIN part of personal code
source: New %1$@ code can't be part of your personal code
et: Uus %1$@-kood ei saa olla osa sinu isikukoodist

# PIN repeat error
source: New %1$@ codes must match
et: Uued %1$@-koodid peavad olema samad

# PIN too easy
source: New %1$@ code can't be so easy
et: Uus %1$@-kood ei saa olla nii lihtne

# PIN unblocked
source: %@ unblocked
et: %@ blokeering tühistatud

# PIN verification error multiple
source: Wrong %1$@ code. You can try %2$@ more times.
et: Vale %1$@-kood. Saad veel proovida %2$@ korda.

# PIN verification error one
source: Wrong %1$@ code. You can try 1 more time.
et: Vale %1$@-kood. Saad veel proovida 1 kord.

# PIN1 guideline 1
source: New PIN1 must be different from current PIN1.
et: Uus PIN1 peab olema erinev eelmisest.

# PIN1 guideline 2
source: PIN1 code is used for authentication.
et: PIN1-koodi kasutatakse isikutuvastamiseks.

# PIN1 guideline 3
source: If PIN1 is inserted incorrectly 3 times, the identification certificate will be blocked and it will be impossible to use ID-card to verify identification, until it is unblocked via the PUK code.
et: Kui sisestad PIN1-koodi kolm korda valesti, siis isikutuvastamise sertifikaat blokeeritakse ning ID-kaarti pole võimalik isikutuvastamiseks kasutada enne blokeeringu tühistamist PUK-koodi abil.

# PIN2 guideline 1
source: New PIN2 must be different from current PIN2.
et: Uus PIN2 peab olema erinev eelmisest.

# PIN2 guideline 2
source: PIN2 code is used to digitally sign documents.
et: PIN2-koodi kasutatakse digitaalallkirja andmiseks.

# PIN2 guideline 3
source: If PIN2 is inserted incorrectly 3 times, the signing certificate will be blocked and it will be impossible to use ID-card for digital signatures, until it is unblocked via the PUK code.
et: Kui sisestad PIN2-koodi kolm korda valesti, siis allkirjastamise sertifikaat blokeeritakse ning ID-kaarti pole võimalik allkirjastamiseks kasutada enne blokeeringu tühistamist PUK-koodi abil.

source: PIN's and certificates
et: PIN-koodid ja sertifikaadid

source: Please place your ID card against the smart device.
et: Palun asetage oma ID-kaart vastu nutiseadet.

# PUK blocked
source: PUK has been blocked because PUK code has been entered incorrectly 3 times. You can not unblock the PUK code yourself. As long as the PUK code is blocked, all eID options can be used, except transactions that need PUK code. Please visit the service center to obtain new codes.
et: PUK on blokeeritud, kuna PUK-koodi on sisestatud 3 korda valesti. PUK-koodi ei saa ise lahti blokeerida. Kuigi PUK-kood on blokeeritud, saab kõiki eID võimalusi kasutada, välja arvatud PUK-koodi vajavaid. Uue PUK-koodi saamiseks külasta klienditeeninduspunkti, kust saad uue koodiümbriku uute koodidega.

# PUK blocked URL
source: https://www.id.ee/en/article/changing-id-card-pin-codes-and-puk-code/
et: https://www.id.ee/artikkel/id-kaardi-pin-ja-puk-koodide-muutmine/

source: PUK code
et: PUK-kood

# PUK code info
source: The PUK code is in the ID card's code envelope.
et: PUK-kood on ID-kaardi koodiümbrikus.

# PUK code info 2
source: The PUK code cannot be changed for an identified card. If the code is lost, you can view it in the self-service portal of the Police and Border Guard Board.
et: Tuvastatud kaardil ei saa PUK-koodi muuta. Kaotatud koodi saad vaadata Politsei- ja Piirivalveameti iseteenindusest.

# PUK guideline 1
source: PUK code is used for unblocking the certificates when PIN1 or PIN2 has been entered 3 times incorrectly.
et: PUK-koodi abil saab tühistada sertifikaadi blokeeringu, kui PIN1- või PIN2-koodi on 3 korda järjest valesti sisestatud.

# PUK guideline 2
source: If you forget the PUK code or the certificates remain blocked, you have to visit the service center to obtain new codes.
et: Kui peale vahetamist PUK-kood ununeb ja sertifikaat jääb blokeerituks kolme vale PIN1 või PIN2 sisestamise järel, siis ainus võimalus ID-kaart jälle tööle saada on pöörduda klienditeeninduspunkti poole.

# Radiobutton selected
source: selected
et: valitud

# Radiobutton unselected
source: unselected
et: valimata

source: Read more here
et: Loe täpsemalt siit

source: Reading data, please wait.
et: Andmete lugemine käib, palun oodake.

source: Recent documents
et: Hiljutised ümbrikud

source: Recently added
et: Viimati lisatud

source: Recipient
et: Adressaat

source: Recipient already exists in the container
et: Adressaat on konteineris juba olemas

# Recipient certificate
source: Recipient’s certificate
et: Adressaadi sertifikaat

# Recipient certificate expiry date
source: Recipient's certificate expiry date
et: Adressaadi sertifikaadi aegumiskuupäev

# Recipient certificate issuer
source: Recipient’s certificate issuer
et: Adressaadi sertifikaadi väljaandja

source: Recipient details
et: Adressaadi andmed

source: Remember me
et: Pea mind meeles

# Remember me message
source: The selected method and data fields will be filled in for the next usage
et: Järgmisel kasutamisel on valitud meetod ja andmeväljad täidetud

source: Remove
et: Eemalda

source: Remove container
et: Eemalda konteiner

# Remove container message
source: Remove container?
et: Soovid eemaldada ümbriku?

# Remove datafile
source: Remove file
et: Eemalda fail

# Remove datafile from container message
source: Remove file from container?
et: Soovid eemaldada faili ümbrikust?

source: Remove file
et: Eemalda fail

# Remove last datafile from container message
source: You are about to remove the last file in the container, it is removed along with the container.
et: Oled kustutamas viimast faili ümbrikus, koos sellega eemaldatakse ka ümbrik.

source: Remove recipient
et: Eemaldada adressaat

source: Remove recipient from container?
et: Soovid eemaldada adressaati?

source: Remove signature
et: Eemalda allkiri

source: Remove signature from container?
et: Soovid eemaldada allkirja?

# Repeat new PIN code
source: Repeat new %1$@ code
et: Korda uut %1$@-koodi

source: Request sending error
et: Päringu saatmise viga

# Role and address title
source: Enter your role and address info
et: Sisesta oma roll ja aadress

# Role title
source: Role / resolution
et: Roll / resolutsioon

source: Save
et: Salvesta

source: Save container
et: Salvesta ümbrik

source: Save file
et: Salvesta fail

# Save new PIN
source: Save new %1$@ code
et: Salvesta uus %1$@-kood

source: Save selection
et: Salvesta valik

source: Search container file...
et: Otsi ümbrikku...

source: Search recipients…
et: Leia adressaat…

source: Selected
et: Valitud

source: Settings
et: Seaded

source: Share
et: Jaga

source: Share container
et: Jaga ümbrikut

# Share Extension Import Completed
source: Files are now cached for you. Go to RIA DigiDoc application to finish import
et: Failid on ajutisse kausta salvestatud. Impordi lõpetamiseks mine RIA DigiDoc rakendusse.

# Share Extension Import Failed
source: Failed to import file
et: Faili importimine ebaõnnestus

# Share Extension Import Progress
source: Importing files...
et: Laadin faile...

# Share Extension Import Title
source: Importing file
et: Faili import

source: Show password
et: Näita parooli

source: Sign
et: Allkirjasta

source: Sign container
et: Allkirjasta dokument

source: Sign document
et: Allkirjasta dokument

source: Signature
et: Allkiri

source: Signature added
et: Allkiri lisatud

# Signature detail invalid reason
source: This is an invalid signature or malformed digitally signed file. The signature is not valid.
et: See allkiri või allkirjastatud fail on vigane. Allkiri ei ole kehtiv.

# Signature detail non-qscd reason
source: This e-Signature is not equivalent with handwritten signature and therefore can be used only in transactions where Qualified e-Signature is not required.
et: See e-allkiri ei ole käsitsi kirjutatud allkirjadega samaväärne ja seetõttu saab seda kasutada ainult tehingute puhul, kus kvalifitseeritud e-allkiri pole kohustuslik.

# Signature detail unknown reason
source: Signature status is displayed "unknown" if you don't have all validity confirmation service certificates and/or certificate authority certificates installed into your computer. Additional information: https://www.id.ee/en/article/digidoc4-client-error-ocsp-responder-is-not-trusted-no-certificate-for-this-responder-in-local-certstore
et: Allkirja staatust kuvatakse "teadmata", kui Sinu arvutisse pole lisatud kõiki kehtivuskinnituse teenuse sertifikaate ja/või nende kontrolliks vajalikke sertifikaate. Lisainfo: https://www.id.ee/artikkel/digidoc4-klient-viga-ocsp-responder-is-not-trusted-no-certificate-for-this-responder-in-local-certstore

# Signature detail warning reason
source: The signature is valid, but the container has a specific feature. Usually, this feature has arisen accidentally when containers were created. However, as it is not possible to edit a container without invalidating the signature, a warning is displayed. Additional information: https://www.id.ee/en/article/digital-signing-and-electronic-signatures/
et: Allkiri on kehtiv, aga ümbrikul on mingi eripära. Tavaliselt on selline eripära tekkinud ümbriku loomisel. Kuna ümbrikku ei ole võimalik muuta ilma, et allkiri kehtetuks muutuks, näidatakse selliste ümbrike puhul hoiatust. Lisainfo: https://www.id.ee/artikkel/digitaalne-allkirjastamine-ja-elektroonilised-allkirjad

# Signature detail weak reason
source: The signature is technically correct, but it is based on the currently weak hash algorithm SHA-1, therefore it is not protected against forgery or alteration.
et: Allkiri on tehniliselt korrektne, kuid põhineb praeguseks nõrgaks hinnatud räsialgoritmil SHA-1, mistõttu ei ole see kaitstud võltsimise või muutmise eest.

source: Signature details
et: Allkirja detailid

source: Signature format
et: Allkirja formaat

source: Signature is invalid
et: Allkiri ei ole kehtiv

source: Signature is unknown
et: Allkiri on teadmata

source: Signature is valid
et: Allkiri on kehtiv

# Signature is valid non qscd
source: Signature is valid (Restrictions)
et: Allkiri on kehtiv (Piirangud)

# Signature is valid with warnings
source: Signature is valid (Warnings)
et: Allkiri on kehtiv (Hoiatused)

source: Signature method
et: Allkirja meetod

source: Signature timestamp
et: Allkirja ajatempel

source: Signature timestamp (UTC)
et: Allkirja ajatempel (UTC)

source: Signed %@ at %@
et: Allkirjastatud %@ kell %@

source: Signed file count
et: Allkirjastatud failide arv

source: Signer's Certificate
et: Allkirjastaja sertifikaat

source: Signer's certificate issuer
et: Allkirjastaja sertifikaadi väljaandja

source: Signer's mobile time
et: Allkirjastaja telefoni kellaaeg (UTC)

# Signers role and address title
source: Signer
et: Allkirjastaja

source: Signing
et: Allkirjastamine

source: Signing certificate
et: Allkirjastamise sertifikaat

source: Signing in progress, please wait.
et: Signeerimine käib, palun oodake.

source: Signing method
et: Allkirjastamise meetod

source: Signing method changed
et: Allkirjastamise meetod muudetud

# Signing technical error
source: Failed to send request. %@ service has encountered technical errors. Please try again later
et: Päringu saatmine ebaõnnestus. %@ teenuses esinevad tehnilised tõrked. Palun proovige mõne aja pärast uuesti

source: SIM error
et: SIM-kaardi viga

# Siva message
source: This type of signed document will be transmitted to the Digital Signature Validation Service SiVa to verify the validity of the digital signature. Read more information about transmitted data to Digital Signature Validation Service on the id.ee website. Do you want to continue?
et: Seda tüüpi allkirjastatud dokument edastatakse digitaalallkirjade kehtivuse kontrollimiseks valideerimisteenusele SiVa. Digitaalallkirjade kehtivuse kontrollimisel edastatud andmete kohta loe lähemalt id.ee veebilehelt. Kas soovid jätkata?

# Siva message url
source: https://www.id.ee/en/article/data-protection-conditions-for-the-id-software-of-the-national-information-system-authority/
et: https://www.id.ee/artikkel/riigi-infosusteemi-ameti-id-tarkvara-andmekaitsetingimused/

# Smart-ID certificate level not qualified
source: Your Smart-ID certificate level must be qualified to sign documents in RIA DigiDoc mobile application
et: RIA DigiDoc mobiilirakenduses allkirjastamiseks peab sinu Smart-ID vastama tasemele kõrge

# Smart-ID notification title
source: Smart-ID signing control code
et: Smart-ID allkirjastamise kontrollkood

# Smart-ID old api
source: RIA DigiDoc mobile application needs an upgrade. Please install new version from the mobile app store. Additional info is available ID-helpline (+372) 666 8888
et: RIA DigiDoc mobiilirakendus vajab uuendamist. Paigalda uus versioon mobiilirakenduse poest. Lisainfo ID-abiliini telefonil (+372) 666 8888

# Smart-ID session not found
source: Session not found
et: Sessiooni ei leitud

# Smart-ID under maintenance
source: Smart-ID service has encountered technical errors. Please try again later
et: Smart-ID teenuses esinevad tehnilised tõrked. Palun proovi mõne aja pärast uuesti

# Smart-ID wrong vc
source: Error: an incorrect control code was chosen
et: Viga: valiti vale kontrollkood

# SSL handshake failed
source: SSL handshake failed. Check your application settings or software upgrades
et: SSL ühenduskanali loomine ebaõnnestus. Kontrolli rakenduse seadeid või tarkvara uuendusi

# State title
source: State
et: Maakond

source: Surname
et: Perekonnanimi

source: Tab
et: Vahekaart

# Technical information title
source: TECHNICAL INFORMATION
et: TEHNILINE INFORMATSIOON

source: This app cannot be used in jailbroken device
et: Seda rakendust ei saa kasutada turvamata (ingl jailbroken) seadmes

source: Timestamp
et: Ajatempel

# Too many requests
source: The limit for %@ digital signatures per month has been reached
et: Sinu %@ tasuta allkirjade kuulimiit on ületatud

# Too many requests url
source: https://www.id.ee/en/article/for-organisations-that-sign-large-quantities-of-documents-using-digidoc4-client/
et: https://www.id.ee/artikkel/asutustele-kus-allkirjastatakse-digidoc4-kliendi-kaudu-suuremates-kogustes-dokumente/

# Too many results
source: The name you were looking for gave too many results, please refine your search
et: Sinu otsitud nimi andis liiga palju vastuseid, palun täpsusta otsingut

source: TS Certificate
et: Ajatempliteenuse sertifikaat

source: TS Certificate issuer
et: Ajatempliteenuse sertifikaadi väljaandja

# Unblock PIN
source: Unblock %@
et: Tühista %@ blokeering

# Unknown signature
source: %d unknown signatures
et: %d allkirja on teadmata

source: Unselected
et: Valimata

# Unsupported container
source: The current file is a DigiDoc container that is not supported officially any longer. You are not allowed to add or remove signatures to this container.
et: Tegemist on vanas formaadis DigiDoc ümbrikuga. Sellele ümbrikule ei saa allkirja lisada ega eemaldada.

source: User denied or cancelled
et: Kasutaja keeldus või katkestas

# Valid signature
source: %d valid signatures
et: %d kehtivat allkirja

source: (valid to %@)
et: (kehtiv kuni %@)

# Valid to date
source: Valid to
et: Kehtiv kuni

# Xades message
source: This ASICS container contains XADES signature. You are not allowed to add or remove signatures to this container.
et: Tegemist on XADES allkirja sisalduva ASICS ümbrikuga. Sellele ümbrikule ei saa allkirja lisada ega eemaldada.

# Zip code title
source: Zip code
et: Postikood
